In [1]:
!ls

census.csv  myDataFrame.csv	PandasPythonForDataScience.pdf
hrdata.csv  pandas-intro.ipynb	read-csv.ipynb

In [2]:
import pandas as pd

In [6]:
df = pd.read_csv("hrdata.csv")
df.head()

             Name Hire Date   Salary  Sick Days remaining
0  Graham Chapman  03/15/14  50000.0                   10
1     John Cleese  06/01/15  65000.0                    8
2       Eric Idle  05/12/14  45000.0                   10
3     Terry Jones  11/01/13  70000.0                    3
4   Terry Gilliam  08/12/14  48000.0                    7

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Name                   6 non-null object
Hire Date              6 non-null object
Salary                 6 non-null float64
Sick Days remaining    6 non-null int64
dtypes: float64(1), int64(1), object(2)
memory usage: 272.0+ bytes

In [9]:
df = pd.read_csv("hrdata.csv", index_col='Name')
df.head()

               Hire Date   Salary  Sick Days remaining
Name
Graham Chapman  03/15/14  50000.0                   10
John Cleese     06/01/15  65000.0                    8
Eric Idle       05/12/14  45000.0                   10
Terry Jones     11/01/13  70000.0                    3
Terry Gilliam   08/12/14  48000.0                    7

In [11]:
df = pd.read_csv("hrdata.csv", index_col='Name', parse_dates=['Hire Date'])
df.head()

                Hire Date   Salary  Sick Days remaining
Name
Graham Chapman 2014-03-15  50000.0                   10
John Cleese    2015-06-01  65000.0                    8
Eric Idle      2014-05-12  45000.0                   10
Terry Jones    2013-11-01  70000.0                    3
Terry Gilliam  2014-08-12  48000.0                    7

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, Graham Chapman to Michael Palin
Data columns (total 3 columns):
Hire Date              6 non-null datetime64[ns]
Salary                 6 non-null float64
Sick Days remaining    6 non-null int64
dtypes: datetime64[ns](1), float64(1), int64(1)
memory usage: 192.0+ bytes

In [14]:
df = pd.read_csv("hrdata.csv",
                 index_col='Employee',
                 parse_dates=['Hire Date'],
                 header=0,
                 names=['Employee', 'Hire Date', 'Salary', 'Sick Days']
                )
df.head()

                Hire Date   Salary  Sick Days
Employee
Graham Chapman 2014-03-15  50000.0         10
John Cleese    2015-06-01  65000.0          8
Eric Idle      2014-05-12  45000.0         10
Terry Jones    2013-11-01  70000.0          3
Terry Gilliam  2014-08-12  48000.0          7